In [41]:
import pandas as pd
from py2neo import Graph
graph = Graph("neo4j://localhost:7687", auth=("neo4j", "Tyu123Tyu123"))

In [42]:
graph.run('LOAD CSV FROM "file:///data_test.csv" AS file FIELDTERMINATOR ";" MERGE (u1: User1 {name: file[1]}) MERGE (u2: User2 {name: file[2]}) CREATE (u1)-[r:RELTYPE { name: file[0]}]->(u2) RETURN u1.name, r.name, u2.name')

 u1.name                        | r.name     | u2.name
--------------------------------|------------|---------------------------------
 ФИО участника события 1        | id события | ФИО участника события 2
 Галчевская Карина Владимировна | 189        | Белоновская Анастасия Семеновна
 Офицеров Олег Романович        | 206        | Сапожник Борис Валерьевич

In [43]:
graph.run('MATCH (u1)-->(u2) WITH u1, count(*) AS foaf WHERE foaf > 1 RETURN u1.name, foaf').to_data_frame()

                      u1.name  foaf
0    Ахромеева Алина Ивановна    49
1   Башнина Антонина Глебовна    14
2     Пафомова Кира Вадимовна     2
3  Зимнухова Карина Даниловна     4
4    Шолохов Игорь Робертович     2
5   Диомидов Игорь Ильдарович     5

In [44]:
graph.run('MATCH (u1)-->(u2) WITH u2, count(*) AS foaf WHERE foaf > 1 RETURN u2.name, foaf').to_data_frame()

                            u2.name  foaf
0        Медведева Дарья Алексеевна     5
1  Двигубская Валентина Геннадьевна     2
2          Шолохов Игорь Робертович     2

In [47]:
graph.run('MATCH (u1:User1), (u2:User2), path = shortestpath((u1)-[:RELTYPE*]-(u2)) RETURN path LIMIT 3').to_data_frame()

                       path
0  ({'name': 'id события'})
1         ({'name': '189'})
2         ({'name': '206'})

In [46]:
graph.run('MATCH (u1:User1), (u2:User2), path = shortestpath((u1)-[:RELTYPE*]-(u2)) RETURN u1, path, u2 ORDER BY LENGTH(path) DESC LIMIT 1').to_data_frame()

,u1,path,u2
0,{'name': 'Торгунаков Роман Кириллович'},"({'name': '750824'}, {'name': '829652'}, {'nam...",{'name': 'Ляуданский Валентин Владиславович'}